webbdrew20-cmd/The_Beacon/s3_wroom_beacon/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# ---- Flash & partitions (WROOM-2 modules are 16MB or 32MB — set to
# match yours; 16MB works on both) ----
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ---- PSRAM: WROOM-2 modules carry octal PSRAM. If boot fails at
# PSRAM init, comment these two lines out — this firmware runs fine
# without PSRAM. ----
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y

# ---- FatFs ----
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_FS_LOCK=16

# ---- Networking headroom ----
CONFIG_LWIP_MAX_SOCKETS=16
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=1024
